Fixed remarks for diagram;
